## [staging](https://jace-ys.app.spacelift.io/stack/staging/run/01HV19SFNKJGXCYET3TXXS5PB2) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HV15JZ8YN0KFZCWCA99GM525] Planning changes with 0 custom hooks...
data.google_project.this: Reading...
data.google_client_config.default: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/"emp-jace-a850"/regions/"europe-west1"/zones/<null>]
data.google_project.this: Read complete after 1s [id=projects/emp-jace-a850]
google_secret_manager_secret.tailscale_operator: Refreshing state... [id=projects/emp-jace-a850/secrets/tailscale_operator_staging]
data.google_container_cluster.operator: Reading...
module.cluster.google_project_iam_member.application_layer_secrets_encryption: Refreshing state... [id=emp-jace-a850/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceAccount:service-639381616334@container-engine-robot.iam.gserviceaccount.com]
module.cluster.google_compute_network.cluster: Refreshing state... [id=projects/emp-jace-a850/global/networks/jace-staging-europe-west1]
module.cluster.google_kms_key_ring.keyring: Refreshing state... [id=projects/emp-jace-a850/locations/europe-west1/keyRings/jace-staging-europe-west1-keyring]
module.cluster.google_service_account.cluster_nodes: Refreshing state... [id=projects/emp-jace-a850/serviceAccounts/staging-cluster-nodes@emp-jace-a850.iam.gserviceaccount.com]
module.cluster.google_kms_crypto_key.application_layer_secrets_encryption_key: Refreshing state... [id=projects/emp-jace-a850/locations/europe-west1/keyRings/jace-staging-europe-west1-keyring/cryptoKeys/jace-staging-europe-west1-encryption-key]
module.cluster.google_project_iam_member.cluster_nodes_gke_node_service_account: Refreshing state... [id=emp-jace-a850/roles/container.nodeServiceAccount/serviceAccount:staging-cluster-nodes@emp-jace-a850.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.tailscale_operator: Reading...
module.cluster.google_compute_subnetwork.cluster: Refreshing state... [id=projects/emp-jace-a850/regions/europe-west1/subnetworks/jace-staging-europe-west1]
module.cluster.google_compute_router.cluster: Refreshing state... [id=projects/emp-jace-a850/regions/europe-west1/routers/jace-staging-europe-west1]
data.google_secret_manager_secret_version.tailscale_operator: Read complete after 1s [id=projects/639381616334/secrets/tailscale_operator_staging/versions/1]
module.cluster.google_compute_router_nat.cluster: Refreshing state... [id=emp-jace-a850/europe-west1/jace-staging-europe-west1/jace-staging-europe-west1]
data.google_container_cluster.operator: Read complete after 1s [id=projects/emp-jace-a850/locations/europe-west1/clusters/jace-operator-europe-west1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_secret.cluster_operator will be created
  + resource "kubernetes_secret" "cluster_operator" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "argocd.argoproj.io/secret-type" = "cluster"
              + "example.com/apps-cluster"       = "true"
            }
          + name             = "staging-operator"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.operator_oauth will be created
  + resource "kubernetes_secret" "operator_oauth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "operator-oauth"
          + namespace        = "tailscale-operator"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster.google_container_cluster.cluster will be created
  + resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = "ADVANCED_DATAPATH"
      + default_max_pods_per_node   = (known after apply)
      + deletion_protection         = true
      + enable_fqdn_network_policy  = true
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_multi_networking     = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "jace-staging-europe-west1"
      + network                     = "jace-staging-europe-west1"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "emp-jace-a850"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "jace-staging-europe-west1"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + config_connector_config {
              + enabled = true
            }
          + dns_cache_config {
              + enabled = true
            }
        }

      + authenticator_groups_config {
          + security_group = "gke-security-groups@duffel.com"
        }

      + cost_management_config {
          + enabled = true
        }

      + database_encryption {
          + key_name = "projects/emp-jace-a850/locations/europe-west1/keyRings/jace-staging-europe-west1-keyring/cryptoKeys/jace-staging-europe-west1-encryption-key"
          + state    = "ENCRYPTED"
        }

      + dns_config {
          + cluster_dns        = "CLOUD_DNS"
          + cluster_dns_domain = "cluster.staging"
          + cluster_dns_scope  = "VPC_SCOPE"
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = "10.40.0.0/16"
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = "10.28.0.0/18"
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "SCHEDULER",
              + "WORKLOADS",
            ]
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "APISERVER",
              + "SCHEDULER",
              + "CONTROLLER_MANAGER",
            ]

          + advanced_datapath_observability_config {
              + enable_metrics = false
              + enable_relay   = false
              + relay_mode     = (known after apply)
            }

          + managed_prometheus {
              + enabled = false
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "172.18.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + security_posture_config {
          + mode               = "BASIC"
          + vulnerability_mode = "VULNERABILITY_BASIC"
        }

      + workload_identity_config {
          + workload_pool = "emp-jace-a850.svc.id.goog"
        }
    }

  # module.cluster.google_container_node_pool.node_pool["default-1"] will be created
  + resource "google_container_node_pool" "node_pool" {
      + cluster                     = "jace-staging-europe-west1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "default-1-europe-west1"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "emp-jace-a850"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 1
          + min_node_count  = 1
        }

      + node_config {
          + disk_size_gb      = 50
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "COS_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "c3d-standard-4"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = "staging-cluster-nodes@emp-jace-a850.iam.gserviceaccount.com"
          + spot              = false

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 1
          + strategy        = "SURGE"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

[01HV15JZ8YN0KFZCWCA99GM525] Changes are GO
[01HV15JZ8YN0KFZCWCA99GM525] Uploading the list of managed resources...
[01HV15JZ8YN0KFZCWCA99GM525] Please be aware that the run changes calculation includes output changes.
[01HV15JZ8YN0KFZCWCA99GM525] Resource list upload is GO
[01HV15JZ8YN0KFZCWCA99GM525] Generating JSON representation of the plan...
[01HV15JZ8YN0KFZCWCA99GM525] JSON representation is GO
[01HV15JZ8YN0KFZCWCA99GM525] Loading custom plan policy inputs...
[01HV15JZ8YN0KFZCWCA99GM525] 0 custom plan policy inputs found
[01HV15JZ8YN0KFZCWCA99GM525] No plan policies to evaluate
```

</details>